Autodesk.Revit.DB.RuledSurface.GetSecondProfilePoint
If a point was used to define the second profile, returns a copy of that point. Otherwise return NULL.
Returns:
The second profile point if it was set, NULL otherwise.
Since:
2017

Autodesk.Revit.DB.RuledSurface.GetSecondProfileCurve
Returns a copy of the second profile curve if it is set. If a point was used to define the second profile, this function will return NULL.
Returns:
A copy of the second profile curve, if it exists.
Since:
2017

Autodesk.Revit.DB.RuledSurface.GetFirstProfilePoint
If a point was used to define the first profile, returns a copy of that point. Otherwise return NULL.
Returns:
The first profile point if it was set, NULL otherwise.
Since:
2017

Autodesk.Revit.DB.RuledSurface.GetFirstProfileCurve
Returns a copy of the first profile curve if it is set. If a point was used to define the first profile, this function will return NULL.
Returns:
A copy of the first profile curve, if it exists.
Since:
2017